In [4]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import math as math
suppliers = pd.read_csv("./suppliers.csv",usecols=['SupplierID','CompanyName','Country'])
suppliers.head()

   SupplierID                         CompanyName Country
0           1                      Exotic Liquids      UK
1           2          New Orleans Cajun Delights     USA
2           3           Grandma Kelly's Homestead     USA
3           4                       Tokyo Traders   Japan
4           5  Cooperativa de Quesos 'Las Cabras'   Spain

In [5]:
customers = pd.read_csv("./customers.csv", usecols=['CustomerID','CompanyName','Country'])
customers.head()

  CustomerID                         CompanyName  Country
0      ALFKI                 Alfreds Futterkiste  Germany
1      ANATR  Ana Trujillo Emparedados y helados   Mexico
2      ANTON            Antonio Moreno Taquer?­a   Mexico
3      AROUT                     Around the Horn       UK
4      BERGS                 Berglunds snabbk?¶p   Sweden

In [6]:
len(suppliers)

29

In [7]:
len(customers)

91

In [8]:
suppliers.append(customers)

    SupplierID                         CompanyName  Country CustomerID
0          1.0                      Exotic Liquids       UK        NaN
1          2.0          New Orleans Cajun Delights      USA        NaN
2          3.0           Grandma Kelly's Homestead      USA        NaN
3          4.0                       Tokyo Traders    Japan        NaN
4          5.0  Cooperativa de Quesos 'Las Cabras'    Spain        NaN
..         ...                                 ...      ...        ...
86         NaN                      Wartian Herkku  Finland      WARTH
87         NaN              Wellington Importadora   Brazil      WELLI
88         NaN                White Clover Markets      USA      WHITC
89         NaN                         Wilman Kala  Finland      WILMK
90         NaN                      Wolski  Zajazd   Poland      WOLZA

[120 rows x 4 columns]

In [9]:
df_appended = suppliers.append(customers)

In [10]:
len(df_appended)

120

In [11]:
df_appended = suppliers.append(customers, ignore_index=True)

In [12]:
len(df_appended)

120

In [14]:
suppliers2 = suppliers.copy()
suppliers2.rename({'SupplierID':'CustomerID'}, axis='columns', inplace=True)
suppliers2.head()

   CustomerID                         CompanyName Country
0           1                      Exotic Liquids      UK
1           2          New Orleans Cajun Delights     USA
2           3           Grandma Kelly's Homestead     USA
3           4                       Tokyo Traders   Japan
4           5  Cooperativa de Quesos 'Las Cabras'   Spain

In [15]:
suppliers2.append(customers)

   CustomerID                         CompanyName  Country
0           1                      Exotic Liquids       UK
1           2          New Orleans Cajun Delights      USA
2           3           Grandma Kelly's Homestead      USA
3           4                       Tokyo Traders    Japan
4           5  Cooperativa de Quesos 'Las Cabras'    Spain
..        ...                                 ...      ...
86      WARTH                      Wartian Herkku  Finland
87      WELLI              Wellington Importadora   Brazil
88      WHITC                White Clover Markets      USA
89      WILMK                         Wilman Kala  Finland
90      WOLZA                      Wolski  Zajazd   Poland

[120 rows x 3 columns]

## concat()

In [17]:
df_concatenated = pd.concat(objs=[suppliers,customers])

In [18]:
len(df_concatenated)

120

In [20]:
df_concatenated

    SupplierID                         CompanyName  Country CustomerID
0          1.0                      Exotic Liquids       UK        NaN
1          2.0          New Orleans Cajun Delights      USA        NaN
2          3.0           Grandma Kelly's Homestead      USA        NaN
3          4.0                       Tokyo Traders    Japan        NaN
4          5.0  Cooperativa de Quesos 'Las Cabras'    Spain        NaN
..         ...                                 ...      ...        ...
86         NaN                      Wartian Herkku  Finland      WARTH
87         NaN              Wellington Importadora   Brazil      WELLI
88         NaN                White Clover Markets      USA      WHITC
89         NaN                         Wilman Kala  Finland      WILMK
90         NaN                      Wolski  Zajazd   Poland      WOLZA

[120 rows x 4 columns]